app/Views/pages/Admin/BerandaAdmin.php

                        <h4 class="card-text"> <a href="/cekkeluhan">Keluhan Hari ini</a></h4>
                <?php
                $pengaduanModel = new App\Models\PengaduanModel();
                $data = $pengaduanModel->get()->getResult();
---
SELECT *
FROM `pengaduan`