app/Views/pages/Admin/cekkeluhan.php

SELECT *
FROM `pengaduan`
---
            <tbody>
                <?php
                $model = new \App\Models\PengaduanModel();
                $data = $model->get()->getResult();

SELECT *
FROM `user`
WHERE `level` = 'pegawai'
---
                            <input type="text" name="id_pengaduan" value="<?= $row->id_pengaduan ?>" style="display:none">
                            <td><select name="namaPengelola" class="form-select" aria-label="Default select example">
                            <?php $userModel = new \App\Models\UserModel();
                            $data = $userModel->where(['level' => 'pegawai'])->get()->getResult();