app/Controllers/BerandaController.php

SELECT COUNT(*) AS `numrows`
FROM `pengaduan`
SELECT COUNT(*) AS `numrows`
FROM `program`
---
    public function beranda()
    {
        $RandomGaleri = $this->DataGaleri->GetDataGaleriRandom();
        $alamat = $this->DataAlamat->findAll();
        $artikel = $this->DataArtikel->getRandomArtikel();
        $totalPengaduan = $this->DataPengaduan->countAllResults();
        $totalProgram = $this->DataProgram->countAllResults();