app/Controllers/Login.php

    public function login()
    {
        $user = $this->DataUser->findAll();
---
SELECT *
FROM `user`

    public function loginauth(){
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');
        $Auth = $this->DataUser->where([
            'username' => $username,
            'password' => password_verify($password, PASSWORD_DEFAULT),
        ])->get()->getRow();
        session()->set([
            'username' => $Auth->username,
            'password' => $Auth->password,
            'email' => $Auth->email,
            'level' => $Auth->level,
        ]);
        $alamat = $this->DataAlamat->findAll();
        $pengudanHariIni = $this->DataPengaduan->findAll();
        $pengguna = $this->DataUser->findAll();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `password` = 0
SELECT *
FROM `pengaduan`
SELECT *
FROM `user`