app/Controllers/Pengaduan.php

INSERT INTO `pengaduan` (`siapa`, `keluhan`, `no_hp`, `korban`, `sila`, `masih`, `tanggung`, `apa`, `pilih`, `kapan`, `kejadian`, `lokasi`, `detail`, `pelaku`, `kontak`, `kontaklain`, `tanggal_dibuat`, `email`, `info`, `pengelola`, `statuspengaduan`, `statuskonsultasi`) VALUES ('Saya pernah mengalami kekerasan seksual', 'fasd', '123312', 'Korban adalah Pegawai Politala yang aktif', 'Saya belum siap memberikan kontak, namun akan menghubungi lagi suatu saat', 'Ya', 'Pegawai Politala aktif', 'Ya', 'Saya mengetahui pelaku tetapi tidak ingin mengungkapnya', 'Dalam seminggu terakhir', 'asdf', 'Sungai Jelai', 'afsafsd', 'safd', 'dsaf', 'fsasad', '2023-12-27 11:05:30', 'fas', 'dasfas', 'Belum Ada', 'Belum Diterima', 'Belum Konsultasi')
---
            'statuskonsultasi' => 'Belum Konsultasi',
        ];

        $PengaduanModel->insert($insertData);

SELECT *
FROM `pengaduan`
WHERE `id_pengaduan` = '33'
---
    public function trackingid()
    {
        $PengaduanModel = new PengaduanModel();
        $kode_aduan = $this->request->getPost('kode_aduan');
        $AduanStatus = $PengaduanModel->where([
            'id_pengaduan' => $kode_aduan
        ])->get()->getRow();